visshal_anna_99cats/cats99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_param)
        #maybe some error ternary?
        @cat.save